export const careers = [
  {
    id: "lgcns",
    company: "LG CNS",
    pre: { position: "Infra Architecture", period: "2022.08.01 ~ 2024.03.31" },
    position: "Software Engineer",
    period: "2024.04.01 ~ 현재",
    summary:
      "가전을 중심으로 하는 커뮤니티 플랫폼의 웹/앱 서비스를 개발하고 있습니다. 서비스 개선 과제와 신규 프로젝트를 수행하면서, 서비스의 안정성을 유지하는 동시에 효율적인 리팩토링을 하기위해 작업 시간과 코드 품질 사이의 균형을 맞추는 노력을 하고 있습니다. 기존 로직의 큰 흐름은 유지하되, 상태 관리 문제, 불필요한 API 호출, 컴포넌트 중복 등의 이슈를 해결하며 주어진 기간 내에 안정적인 결과물을 만들어내기 위해 힘쓰고 있습니다. 이러한 과정을 통해 문제 해결 능력은 물론, 시간 관리와 우선순위 설정의 중요성을 배우고 있습니다.",
  },
  {
    id: "planery",
    company: "플래너리",
    position: "풀스택 개발자",
    period: "2020.07 ~ 2022.07",
    summary:
      "오프라인 콘텐츠·커뮤니티 서비스를 온라인으로 전환하는 디지털 트랜스포메이션(DT) 과정에서 초기 개발팀 멤버로 합류하여, 교육/모임 중심의 웹/앱 플랫폼을 풀스택으로 개발 및 운영했습니다. 그로쓰팀, CX팀 등 다양한 직군과 협업하며 기획부터 개발까지 전 과정을 함께 했고, 서비스를 개선하고 확장하며 문제를 주도적으로 발견하고 해결하는 경험을 쌓았습니다.",
  },
];
